{
  "src/App.jsx": "This file serves as the main application component that sets up routing and page transitions for the French telecom qualification web application. It defines the complete navigation structure with animated page transitions using Framer Motion, ensuring smooth user experience between different stages of the qualification process. The component wraps all pages with consistent motion animations and maintains the overall application layout with a gradient background and navigation bar. This is the central hub that connects all user flow pages from welcome/consent through to appointment booking and success confirmation.\n\nKeywords: ['routing', 'navigation', 'page-transitions', 'french-ui', 'telecom-app']\nComponent Type: ['layout']\nFunctionality: ['Sets up React Router for multi-page navigation with animated transitions between qualification steps']\nUse Case: ['Main application entry point for the French telecom lead qualification system']\nRelated Files: ['src/components/Navbar.jsx', 'src/pages/WelcomeConsent.jsx', 'src/utils/motion.js']",
  "src/pages/WelcomeConsent.jsx": "This file serves as the welcome and consent collection page for the French telecom qualification application, ensuring full GDPR compliance before any user data collection. It presents the value proposition with animated feature cards highlighting guaranteed savings, cybersecurity inclusion, and express auditing services. The component manages user consent for contact authorization and professional status confirmation, storing consent data with timestamps for legal compliance. This is the critical first step that establishes legal permission to contact prospects while presenting compelling reasons to continue with the qualification process.\n\nKeywords: ['consent', 'GDPR', 'welcome-page', 'french-compliance', 'telecom-savings']\nComponent Type: ['UI']\nFunctionality: ['Collects mandatory user consents and presents value proposition with animated features']\nUse Case: ['Legal consent collection before telecom qualification process begins']\nRelated Files: ['src/components/Button.jsx', 'src/components/Card.jsx', 'src/utils/motion.js']",
  "src/pages/BudgetForm.jsx": "This file serves as the budget and services evaluation form where prospects input their current telecom expenses and infrastructure details. It collects critical data including fixed telephony budget, internet costs, phone system type, cybersecurity status, company size, and multi-site information. The component includes helpful tooltips, real-time validation, and progress tracking to guide users through the qualification process. This data is essential for calculating potential savings and determining eligibility for the free consultation offer.\n\nKeywords: ['budget-form', 'telecom-costs', 'validation', 'french-ui', 'qualification']\nComponent Type: ['UI']\nFunctionality: ['Collects and validates telecom budget and infrastructure data with interactive form elements']\nUse Case: ['Second step in qualification process to gather financial and technical information']\nRelated Files: ['src/components/ProgressBar.jsx', 'src/utils/calculations.js', 'src/components/Button.jsx']",
  "src/pages/RoleSelection.jsx": "This file serves as the role selection and decision-maker qualification page that determines if prospects can proceed to appointment booking. It presents a list of professional roles with clear visual indicators for decision-makers versus non-decision makers. For non-decision makers, it collects their manager's email for proper lead routing. This component is crucial for ensuring only qualified decision-makers reach the final consultation booking stage, improving lead quality and sales efficiency.\n\nKeywords: ['role-selection', 'decision-maker', 'qualification', 'lead-routing', 'french-roles']\nComponent Type: ['UI']\nFunctionality: ['Qualifies prospects based on decision-making authority and routes non-decision makers appropriately']\nUse Case: ['Third step in qualification to ensure only decision-makers can book consultations']\nRelated Files: ['src/components/ProgressBar.jsx', 'src/components/Button.jsx', 'src/utils/motion.js']",
  "src/pages/ResultsPage.jsx": "This file serves as the results presentation page that displays calculated savings potential and determines the next steps based on budget eligibility. For qualified prospects (≥€200/month), it shows an animated savings gauge, detailed explanations, and benefits cards leading to appointment booking. For non-qualified prospects, it provides educational content and optional callback form. The component uses the savings calculation utilities to present personalized results with clear visual feedback and appropriate call-to-action buttons.\n\nKeywords: ['results-page', 'savings-calculation', 'eligibility-check', 'animated-gauge', 'french-ui']\nComponent Type: ['UI']\nFunctionality: ['Displays personalized savings results and routes users based on budget eligibility']\nUse Case: ['Fourth step showing qualification results and directing to appointment booking or educational content']\nRelated Files: ['src/components/SavingsGauge.jsx', 'src/utils/calculations.js', 'src/components/ProgressBar.jsx']",
  "src/pages/AppointmentBooking.jsx": "This file serves as the appointment booking interface where qualified prospects schedule their free telecom audit consultation. It collects complete contact information, company details, and address (for on-site visits), while providing an interactive calendar for time slot selection. The component includes appointment type selection (on-site vs remote), final consent confirmation, and comprehensive form validation. This is the critical conversion point where leads become scheduled appointments with proper GDPR consent documentation.\n\nKeywords: ['appointment-booking', 'calendar-selection', 'contact-form', 'consent-confirmation', 'french-scheduling']\nComponent Type: ['UI']\nFunctionality: ['Collects appointment details and schedules consultation meetings with interactive calendar']\nUse Case: ['Final conversion step where qualified leads book their free telecom audit consultation']\nRelated Files: ['src/components/Button.jsx', 'src/components/Card.jsx', 'src/utils/motion.js']",
  "src/pages/SuccessPage.jsx": "Cette page de confirmation affiche le succès de la prise de rendez-vous avec animation de confettis, récapitulatif complet du rendez-vous planifié, étapes suivantes et liens pour ajouter l'événement aux calendriers Google/Outlook. Elle génère automatiquement les liens de calendrier avec tous les détails et propose de démarrer une nouvelle évaluation en nettoyant les données stockées.\n\nKeywords: ['success-confirmation', 'confetti-animation', 'calendar-integration', 'appointment-summary']\nComponent Type: ['UI']\nFunctionality: ['Confirme la prise de rendez-vous et facilite l\\'ajout au calendrier']\nUse Case: ['Page finale du parcours, confirmation et satisfaction utilisateur']\nRelated Files: ['src/pages/AppointmentBooking.jsx', 'src/utils/motion.js', 'src/components/Card.jsx']",
  "src/components/Navbar.jsx": "This file serves as the main navigation component for the French telecom qualification application. It provides a responsive navigation bar with branding, menu links, and GDPR compliance indicators. The component uses Framer Motion for smooth entrance animations and includes active state management for navigation links.\n\nKeywords: ['navigation', 'navbar', 'french', 'telecom', 'branding', 'responsive']\nComponent Type: ['layout']\nFunctionality: ['Provides main site navigation with animated entrance and active state management']\nUse Case: ['Used as the primary navigation component across all pages of the application']\nRelated Files: ['src/App.jsx', 'src/pages/*']",
  "src/components/Button.jsx": "This file provides a comprehensive, reusable button component with multiple variants, sizes, and states. It includes loading states, icon support, and Framer Motion animations for enhanced user interaction. The component supports French loading text and follows the application's design system with proper accessibility features.\n\nKeywords: ['button', 'component', 'reusable', 'variants', 'loading', 'animation']\nComponent Type: ['UI']\nFunctionality: ['Provides interactive button elements with various styles, states, and animations']\nUse Case: ['Used throughout the application for all interactive button elements and form submissions']\nRelated Files: ['src/pages/WelcomeConsent.jsx', 'src/pages/BudgetForm.jsx', 'src/pages/AppointmentBooking.jsx']",
  "src/components/Card.jsx": "This file provides a flexible card component system with multiple variants, specialized components for features and statistics, and consistent styling. It includes hover animations and supports different padding, shadow, and color schemes. The component is designed to be highly reusable across the French telecom application.\n\nKeywords: ['card', 'container', 'layout', 'variants', 'statistics', 'features']\nComponent Type: ['UI']\nFunctionality: ['Provides flexible container components with consistent styling and hover effects']\nUse Case: ['Used for content containers, feature displays, and statistical information throughout the application']\nRelated Files: ['src/pages/ResultsPage.jsx', 'src/pages/AdminPanel.jsx', 'src/components/SavingsGauge.jsx']",
  "src/utils/motion.js": "This file contains a comprehensive collection of Framer Motion animation variants and utilities used throughout the French telecom application. It provides pre-configured animations for page transitions, progress indicators, gauges, confetti effects, and various UI interactions to create a smooth and engaging user experience.\n\nKeywords: ['animation', 'framer-motion', 'variants', 'transitions', 'utilities']\nComponent Type: ['functional']\nFunctionality: ['Provides reusable animation configurations and utilities for consistent motion design']\nUse Case: ['Used by all animated components to maintain consistent motion language across the application']\nRelated Files: ['src/components/ProgressBar.jsx', 'src/components/SavingsGauge.jsx', 'src/pages/SuccessPage.jsx']",
  "src/components/ProgressBar.jsx": "This file provides comprehensive progress bar components including linear, step-based, and circular progress indicators. It supports multiple sizes, colors, and animation options with French text labels. The components are designed to show user progress through the qualification flow and provide visual feedback during form completion.\n\nKeywords: ['progress', 'indicator', 'animation', 'steps', 'circular', 'linear']\nComponent Type: ['UI']\nFunctionality: ['Provides visual progress indicators with animations and multiple display formats']\nUse Case: ['Used to show form completion progress and step navigation throughout the qualification process']\nRelated Files: ['src/pages/BudgetForm.jsx', 'src/pages/RoleSelection.jsx', 'src/utils/motion.js']",
  "src/components/SavingsGauge.jsx": "This file creates an animated semi-circular gauge component to display potential telecom savings in a visually appealing way. It includes SVG-based gauge visualization with gradient colors, animated progress, and detailed savings breakdown in French currency format. The component is specifically designed for the results page to show calculated savings percentages.\n\nKeywords: ['gauge', 'savings', 'animation', 'svg', 'visualization', 'telecom']\nComponent Type: ['UI']\nFunctionality: ['Displays animated savings percentage gauge with monetary calculations and visual feedback']\nUse Case: ['Used on the results page to show potential telecom savings in an engaging visual format']\nRelated Files: ['src/pages/ResultsPage.jsx', 'src/utils/calculations.js', 'src/utils/motion.js']",
  "src/utils/calculations.js": "This file contains comprehensive utility functions for calculating telecom savings, lead scoring, and data validation specific to the French telecom qualification application. It includes business logic for determining savings percentages based on various factors, generating French explanations, and formatting currency values according to French locale standards.\n\nKeywords: ['calculations', 'savings', 'scoring', 'validation', 'telecom', 'french']\nComponent Type: ['functional']\nFunctionality: ['Provides business logic calculations for savings estimation, lead qualification, and data validation']\nUse Case: ['Used throughout the application for calculating and displaying savings, scoring leads, and validating user inputs']\nRelated Files: ['src/pages/ResultsPage.jsx', 'src/components/SavingsGauge.jsx', 'src/pages/AdminPanel.jsx']",
  "src/pages/AdminPanel.jsx": "This file provides a comprehensive admin panel for managing leads generated through the French telecom qualification application. It includes lead listing with search and filtering capabilities, detailed lead information modals, GDPR compliance tracking, lead scoring display, and CSV export functionality. The interface is fully in French and includes proper consent tracking for legal compliance.\n\nKeywords: ['admin', 'panel', 'leads', 'management', 'gdpr', 'export', 'scoring']\nComponent Type: ['layout']\nFunctionality: ['Provides administrative interface for lead management, tracking, and export with GDPR compliance']\nUse Case: ['Used by administrators to manage and track leads generated through the qualification process']\nRelated Files: ['src/utils/calculations.js', 'src/components/Card.jsx', 'src/components/Button.jsx']",
  "src/pages/AdminLogin.jsx": "Ce fichier implémente la page d'authentification pour l'accès administrateur de l'application de qualification télécom. Il contient un formulaire de connexion sécurisé avec validation des identifiants, gestion des erreurs, et redirection vers le panneau d'administration. La page utilise un design sombre et professionnel pour distinguer l'interface administrative de l'interface publique.\n\nKeywords: ['authentication', 'login', 'admin', 'security', 'form validation']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Authentifie les administrateurs avec nom d'utilisateur et mot de passe']\nUse Case: ['Accès sécurisé au panneau d'administration', 'protection des données sensibles']\nRelated Files: ['src/pages/AdminPanel.jsx', 'src/App.jsx', 'src/components/ProtectedAdminRoute.jsx']",
  "src/components/ProtectedAdminRoute.jsx": "Ce composant de protection des routes administratives vérifie l'authentification avant d'autoriser l'accès au panneau d'administration. Il gère la validation de session, l'expiration automatique après 24 heures, et redirige les utilisateurs non authentifiés vers la page de connexion. Il inclut également un écran de chargement pendant la vérification des autorisations.\n\nKeywords: ['route protection', 'authentication', 'session management', 'security']\nComponent Type: ['functional', 'security']\nFunctionality: ['Protège l'accès aux routes administratives et gère l'expiration de session']\nUse Case: ['Sécurisation du panneau d'administration', 'contrôle d'accès']\nRelated Files: ['src/pages/AdminLogin.jsx', 'src/pages/AdminPanel.jsx', 'src/App.jsx']",
  "src/components/AIAnimation.jsx": "Ce composant crée une animation sophistiquée représentant l'intelligence artificielle en action pour démontrer la puissance de l'outil d'analyse télécom. Il combine plusieurs éléments visuels animés incluant des particules flottantes, un cerveau IA central avec anneaux rotatifs, des nœuds de données connectés et un indicateur de statut d'analyse qui cycle à travers différentes étapes. L'animation utilise un dégradé de couleurs bleu-violet avec des effets de glassmorphism pour créer un rendu moderne et technologique.\n\nKeywords: ['animation', 'IA', 'intelligence artificielle', 'particules', 'cerveau', 'données']\nComponent Type: ['UI', 'animation']\nFunctionality: ['Crée une animation immersive représentant l\\'IA en action avec des effets visuels sophistiqués']\nUse Case: ['Page d\\'accueil pour démontrer la technologie', 'Sections hero pour impact visuel']\nRelated Files: ['src/pages/WelcomeConsent.jsx', 'src/utils/motion.js']"
}